data/outputs/python/test4.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.307 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      268000 bytes
HTML transferred:       223000 bytes
Requests per second:    302.42 [#/sec] (mean)
Time per request:       165.331 [ms] (mean)
Time per request:       3.307 [ms] (mean, across all concurrent requests)
Transfer rate:          79.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.8      0      31
Processing:     0  157  28.3    159     205
Waiting:        0   80  47.5     78     203
Total:          0  160  28.5    161     221

Percentage of the requests served within a certain time (ms)
  50%    161
  66%    172
  75%    175
  80%    178
  90%    187
  95%    197
  98%    203
  99%    204
 100%    221 (longest request)